# Задание 1


# client = 'Петя'

# pet = 'Кот'

# print(client)

# print(' и ')

# print(pet)


# =======================================
# Задание 2

# first_pet = 'Заяц'
# second_pet = 'Черепаха'

# print(first_pet, " спит, ", second_pet, " идет")




# ===========================================
# Задание 3
A = int(input("Введи число A: "))     # введенные данные должны быть int (числового типа)
B = int(input("Введи число B: "))


sum = A + B
diff = A - B
div = A/B
multi = A*B
print("Сумма: ", sum)
print("Разность: ", diff)
print("Частное: ", div)
print("Умножение: ", multi)